[
        {
         "category": "Entrees",
         "recipe": "Feta & Bacon Stuffed Chicken",
         "prep": "20min",
         "cook": "40min",
         "ingredients": [
             "3/4 lb bacon, cut into 1 in pieces",
             "1 cup crumbled feta cheese",
             "3 TBSP sour cream",
             "1/8 TBSP dried oregano",
             "1/8 TSP ground pepper",
             "3 4oz skinless, boneless chicken breast halves",
             "1 cup all purpose flour",
             "2 eggs, beaten",
             "1 cup dry bread crumbs",
             "4 potatoes, peeled and cubed",
             "1 sweet onion, chopped",
             "2 TBSP butter",
             "3 TBSP sour cream"
             
         ],
         "directions": "Preheat an oven to 350 degrees F (175 degrees C). Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned but still soft. Reserve the bacon grease in the skillet, and cool the bacon slices on a paper towel-lined plate. Once cool, mix the bacon together with the feta cheese, 3 tablespoons of sour cream, oregano, and black pepper in a small bowl; set aside.Lay a chicken breast flat onto your work surface. Use the tip of a sharp boning or paring knife to cut a 2-inch pocket in the chicken breast. Repeat with the remaining chicken breasts. Spoon the bacon mixture into the pockets. Pour the flour, egg, and bread crumbs into separate, shallow dishes. Gently press the chicken breasts into the flour to coat. Dip each into the beaten egg, then press into bread crumbs.Reheat the bacon grease over medium heat. Brown the chicken breasts on both sides in the hot fat, about 2 minutes per side. Reserve the bacon grease in the pan. Place the breasts on a baking dish, and bake in the preheated oven until the chicken is no longer pink and the filling is hot, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).Meanwhile, place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain.While the potatoes are boiling, cook the onion in the remaining bacon grease over medium heat until very tender and golden brown, about 10 minutes. Once the potatoes are done, mash together with the onion, butter, and remaining 3 tablespoons of sour cream. Serve the chicken breasts accompanied by the mashed potatoes."
     },
        {
         "category": "Entrees",
         "recipe": "BBQ Chicken Grilled Pizza",
         "prep": "15min",
         "cook": "10min",
         "ingredients": [
             "1 chopped cooked chicken",
             "1/2 cup BBQ sauce divided",
             "1 13.8oz package refrigerated pizza dough",
             "2 TBS olive oil, or as needed",
             "1 cup shredded Colby-Monterey Jack cheese",
             "1 cup diced tomatoes, or to taste",
             "jalapenos optional"
             
         ],
         "directions": "Preheat grill for medium heat and lightly oil the grate.Mix chicken and 2 tablespoons barbeque sauce together in a bowl until evenly coated.Roll dough onto a work surface and cut in half to form 2 rectangles. Brush the top of each rectangle with olive oil.Place dough, oil-side down, onto the grill; cook until bottom of dough is browned and top is bubbling up, about 5 minutes. Brush the tops of each dough with oil and flip. pread the remaining barbeque sauce over each crust; top with chicken, Colby-Monterey Jack cheese, and tomatoes.Close the lid of the grill and cook pizza until cheese is melted, 2 to 3 minutes. Remove pizza from grill and cool before slicing, 2 to 3 minutes."
     }
    
]
